{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 54, 54, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "filters": 64}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 11, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.8", "class_name": "Sequential"}